WELCOME = (
    "Добро пожаловать в беседу!\n\n"
    "Этот чат создан специально для "
    "студентов {%(course)s} курса факультета ИКСС. "
    "Здесь будет собрана только важная информация, "
    "которую вы обязаны знать!\n\n"
    "В данном чате есть правила, ниже вы можете с ними ознакомиться.\n"
    "🟧Писать здесь могут только:\n"
    "👉🏼 Староста\n"
    "👉🏼 Зам. старосты\n"
    "👉🏼 Бот\n"
    "Для остальных участников данный чат доступен "
    "только для просмотра информации.\n"
    "🟧Запрещено писать сообщения без предварительного "
    "согласования их со старостой или его заместителем.\n\n"
    "🟧 Полезные ресурсы:\n"
    "✅Бот в Телеграм: https://t.me/BonchGUTBot\n"
    "✅Сайт Бонча: https://www.sut.ru\n"
    "✅ГУТ.Навигатор: https://nav.sut.ru/?cab=k2-117\n"
    "✅Студгородок: https://vk.com/campusut\n"
    "✅Факультет ИКСС: https://vk.com/iksssut\n"
    "✅Группа СПбГУТ: https://vk.com/sutru\n"
    "✅Студсовет: https://vk.com/studsovet.bonch\n"
    "✅InGUT: https://vk.com/ingut\n"
    "✅Подслушано Бонч: https://vk.com/overhear_bonch\n"
    "✅Bonch Media: https://vk.com/bonch.media\n"
    "✅Memgut: https://vk.com/bonchmemes\n"
    "✅Гутка: https://vk.com/gutka_sut\n"
    "✅Первокурсники СПбГУТ: https://vk.com/onegut\n\n"
    "👉🏼 Рекомендуем закрепить данное сообщение"
)


ADDED_SUCCESSFULLY = (
    "Ваша беседа успешно добавлена!\n\n"
    "Теперь вам будут приходить актуальная информация "
    "для %(course)s курса."
)

EDITED_SUCCESSFULLY = (
    "Ваш курс успешно изменен!\n\n"
    "Теперь вам будут приходить актуальная информация "
    "для %(course)s курса."
)

NO_CHAT = (
    "Вашей беседы нет в списке!\n"
    'Для добавления беседы используйте: "Добавить {Ваш курс}"'
)


HELP = (
    "Команды:\n\n"
    "Добавить <course> - Добавляет беседу в БД, "
    "флаг admin значит что в беседу не будут приходить новости\n\n"
    "Рассылка: <courses>, Сообщение - "
    "Рассылает пересланное сообщение\n\n"
    "Рассылка: <courses>, Пост - Рассылает пересланный пост\n\n"
    "Рассылка: <courses>, Текст <text> - Рассылает набранный текст"
)


FORBIDDEN = "У вас нет прав для использования данной команды!"
